uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_errata.h
/***********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      kinetis_errata.h
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2016
    *********************************************************************

*/

// Mask/errata management
//
#if defined MASK_2N45K                                                   // Kinetis KE masks
    #define ERRATA_ID_6946                                               // Core: a debugger write to the I/O port might be corrupted during a processor write
    #define ERRATA_ID_6945                                               // Core: processor executing at HardFault priority might enter Lockup state if an NMI occurs during a waited debugger transaction
#elif defined MASK_3N40J
    #define ERRATA_ID_6946                                               // Core: a debugger write to the I/O port might be corrupted during a processor write
    #define ERRATA_ID_6945                                               // Core: processor executing at HardFault priority might enter Lockup state if an NMI occurs during a waited debugger transaction
    #define ERRATA_ID_6749                                               // I2C: the I2C_C1[MST] bit is not automatically cleared when arbitration is lost
#elif defined MASK_0N22J                                                 // KE02Z
    #define ERRATA_ID_6946                                               // Core: a debugger write to the I/O port might be corrupted during a processor write
    #define ERRATA_ID_6945                                               // Core: processor executing at HardFault priority might enter Lockup state if an NMI occurs during a waited debugger transaction
    #define ERRATA_ID_7331                                               // IO: high current drive pins not in high-Z state during power up
    #define ERRATA_ID_7040                                               // SOC: slow VDD ramp-up might cause unstable startup on some devices during power up at cold temperatures
#elif defined MASK_1N74G                                                 // Kinetis M masks
    #define ERRATA_ID_6946                                               // Core: a debugger write to the I/O port might be corrupted during a processor write
    #define ERRATA_ID_6945                                               // Core: processor executing at HardFault priority might enter Lockup state if an NMI occurs during a waited debugger transaction
    #define ERRATA_ID_6749                                               // I2C: the I2C_C1[MST] bit is not automatically cleared when arbitration is lost
    #define ERRATA_ID_6665                                               // Operating requirements: Limitation of the device operating range
    #define ERRATA_ID_7288                                               // SOC : iRTC current increases when fast IRC is enabled
    #define ERRATA_ID_7289                                               // SOC : iRTC current through Vbat increases when CPU accesses any peripheral registers and is proportional to the BUS frequency
    #define ERRATA_ID_7027                                               // UART: during ISO-7816 T=0 initial character detection invalid initial characters are stored in the RxFIFO
    #define ERRATA_ID_7028                                               // UART: during ISO-7816 initial character detection the parity, framing, and noise error flags can set
    #define ERRATA_ID_6472                                               // UART: ETU compensation needed for ISO-7816 wait time (WT) and block wait time (BWT)
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7029                                               // UART: in ISO-7816 T=1 mode, CWT interrupts assert at both character and block boundaries
    #define ERRATA_ID_7090                                               // UART: in ISO-7816 mode, timer interrupts flags do not clear
    #define ERRATA_ID_7031                                               // UART: in single wire receive mode UART will attempt to transmit if data is written to UART_D
    #define ERRATA_ID_5704                                               // UART: TC bit in UARTx_S1 register is set before the last character is sent out in ISO7816 T=0 mode
    #define ERRATA_ID_7091                                               // UART: UART_S1[NF] and UART_S1[PE] can set erroneously while UART_S1[FE] is set
    #define ERRATA_ID_7092                                               // UART: UART_S1[TC] is not cleared by queuing a preamble or break character
#elif defined MASK_0N33H                                                 // Kinetis KL masks
    #define ERRATA_ID_6665                                               // Operating requirements: Limitation of the device operating range
#elif defined MASK_0N40H
    #define ERRATA_ID_6609                                               // I2C1: DMA transfers using certain OUTDIV1 and OUTDIV4 clock divider combinations will result in corrupted data
    #define ERRATA_ID_6395                                               // MCG: fast IRC fine trim bit is not used by the MCG auto trim machine
    #define ERRATA_ID_6665                                               // Operating requirements: Limitation of the device operating range
    #define ERRATA_ID_6580                                               // SPI1: DMA transfers using certain OUTDIV1 and OUTDIV4 clock divider combinations will result in corrupted data
    #define ERRATA_ID_6060                                               // TSI: out of range interrupt shows incorrect behavior with some configurations
    #define ERRATA_ID_6396                                               // sLCD: LCD_GCR[RVTRIM] bits are in reverse order
#elif defined MASK_0N50M
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_8010                                               // LLWU: CMP flag in LLWU_Fx register cleared by multiple CMP out toggles when exiting LLSx or VLLSx modes
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7857                                               // UART: WT timer in T=0 mode and CWT timer in T=1 mode can expire between 0.2 ETU to 0.8 ETU earlier than programmed
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
#elif defined MASK_0N51M
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_8096                                               // DAC12: DNL for DAC12 operating in Low-Power Mode larger than specification for some devices
    #define ERRATA_ID_8010                                               // LLWU: CMP flag in LLWU_Fx register cleared by multiple CMP out toggles when exiting LLSx or VLLSx modes
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7986                                               // LPUART: the LPUART_TX pin is tri-stated when the transmitter is disabled
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7857                                               // UART: WT timer in T=0 mode and CWT timer in T=1 mode can expire between 0.2 ETU to 0.8 ETU earlier than programmed
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
    #define ERRATA_ID_8101                                               // USBOTG: USB host signal crossover voltage higher than specification at low temperature
#elif defined MASK_0N78M
    #define ERRATA_ID_6990                                               // CJTAG: possible incorrect TAP state machine advance during Check Packet
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_6749                                               // I2C: the I2C_C1[MST] bit is not automatically cleared when arbitration is lost
    #define ERRATA_ID_8010                                               // LLWU: CMP flag in LLWU_Fx register cleared by multiple CMP out toggles when exiting LLSx or VLLSx modes
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_7027                                               // UART: during ISO-7816 T=0 initial character detection invalid initial characters are stored in the RxFIFO
    #define ERRATA_ID_7028                                               // UART: during ISO-7816 initial character detection the parity, framing, and noise error flags can set
    #define ERRATA_ID_6472                                               // UART: ETU compensation needed for ISO-7816 wait time (WT) and block wait time (BWT)
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7029                                               // UART: in ISO-7816 T=1 mode, CWT interrupts assert at both character and block boundaries
    #define ERRATA_ID_7090                                               // UART: in ISO-7816 mode, timer interrupts flags do not clear
    #define ERRATA_ID_7031                                               // UART: in single wire receive mode UART will attempt to transmit if data is written to UART_D
    #define ERRATA_ID_5704                                               // UART: TC bit in UARTx_S1 register is set before the last character is sent out in ISO7816 T=0 mode
    #define ERRATA_ID_7091                                               // UART: UART_S1[NF] and UART_S1[PE] can set erroneously while UART_S1[FE] is set
    #define ERRATA_ID_7092                                               // UART: UART_S1[TC] is not cleared by queuing a preamble or break character
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
    #define ERRATA_ID_8101                                               // USBOTG: USB host signal crossover voltage higher than specification at low temperature
#elif defined MASK_1N15J
    #define ERRATA_ID_6946                                               // Core: a debugger write to the I/O port might be corrupted during a processor write
    #define ERRATA_ID_6945                                               // Core: processor executing at HardFault priority might enter Lockup state if an NMI occurs during a waited debugger transaction
    #define ERRATA_ID_6395                                               // MCG: fast IRC fine trim bit is not used by the MCG auto trim machine
#elif defined MASK_1N40H
    #define ERRATA_ID_6396                                               // sLCD: LCD_GCR[RVTRIM] bits are in reverse order
#elif defined MASK_1N41k
#elif defined MASK_1N71K
    #define ERRATA_ID_3863                                               // ADC: in 16-bit differential mode, ADC may result in a conversion error when positive input is near upper rail reference voltage
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7986                                               // LPUART: the LPUART_TX pin is tri-stated when the transmitter is disabled
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_2580                                               // UART: start bit sampling not compliant with LIN 2.1 specification
    #define ERRATA_ID_7857                                               // UART: WT timer in T=0 mode and CWT timer in T=1 mode can expire between 0.2 ETU to 0.8 ETU earlier than programmed
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
    #define ERRATA_ID_7822                                               // USBReg: some devices have VREG_OUT trim value incorrectly programmed
    #define ERRATA_ID_6396                                               // sLCD: LCD_GCR[RVTRIM] bits are in reverse order
#elif defined MASK_1N96F
    #define ERRATA_ID_6070                                               // I2C: repeat start cannot be generated if the I2Cx_F[MULT] field is set to a non-zero value
    #define ERRATA_ID_6665                                               // Operating requirements: Limitation of the device operating range
    #define ERRATA_ID_5472                                               // SMC: mode transition VLPR->VLLS0 (POR disabled)->RUN, will cause POR & LVD
    #define ERRATA_ID_6060                                               // TSI: out of range interrupt shows incorrect behavior with some configurations
#elif defined MASK_1N97K
#elif defined MASK_2N97F
#elif defined MASK_0M33Z                                                 // Kinetis K masks
    #define ERRATA_ID_2550                                               // ADC: ADC abort conversion logic error
    #define ERRATA_ID_3863                                               // ADC: conversion error when positive input is near upper rail reference voltage
    #define ERRATA_ID_2776                                               // CRC: may have incorrect CDC rsult when performing CRC 8 or 16 bit writes with transpose enabled
    #define ERRATA_ID_2547                                               // DAC: 12-bit DAC buffer registers cannot be read
    #define ERRATA_ID_2670                                               // ENET: IEEE 1588 TS_AVAIL interrut is incorrectly mapped to NVIC vector 94
    #define ERRATA_ID_2579                                               // ENET: no support for IEEE 1588 TS_TIMER timestamp timer overflow interrupt
    #define ERRATA_ID_2596                                               // EzPort and FTFL: the 64-bit flash programming command PGMSEC is not fully implemented
    #define ERRATA_ID_2647                                               // FMC: cache aliasing is not supported on 512k and 384k program flash onyl devices
    #define ERRATA_ID_2687                                               // FMC: flash clock divider setting for divide-by-1 is not allowed
    #define ERRATA_ID_2448                                               // FMC: flash prefetch could result in incorect read data
    #define ERRATA_ID_2671                                               // FMC: incorrect data returned during speculative access
    #define ERRATA_ID_2590                                               // FMC: master access protection encoding for write only access does not work as specified
    #define ERRATA_ID_2683                                               // FMC: program flash only configuration cache/page buffer bank control does not follow specification
    #define ERRATA_ID_2644                                               // FMC: ppeculation logic is not supported on program flash only or program flash only with swap feature devices
    #define ERRATA_ID_2668                                               // FTFL: brown-out recovery during a 32-bit EEE write operation is not supported
    #define ERRATA_ID_3854                                               // FTFL: cannot connect to MCU via JTAG or EzPort interfaces after a Reset, POR, LVD event during a program sequence
    #define ERRATA_ID_2667                                               // FTFL: EEE brownout recovery after SETRAM command is not supported
    #define ERRATA_ID_2592                                               // FTFL: EEESPLIT feature not fully implemented
    #define ERRATA_ID_3374                                               // FTFL: erase operation is not reliable if VDD is approximately 1.9 V or less
    #define ERRATA_ID_3372                                               // FTFL: reset during an EEE program operation may result in an invalid EEE read access
    #define ERRATA_ID_3855                                               // FTFL: SWAP feature is not supported
    #define ERRATA_ID_2597                                               // FTFL: version ID field is not supported
    #define ERRATA_ID_2784                                               // FTFL: warm reset during EEE copy-down prevents EEE copy down from successfully completing
    #define ERRATA_ID_2781                                               // FlexBus: false bus error on back-to-back writes when flash memory is secure
    #define ERRATA_ID_2616                                               // FlexCAN: module receives data frames sent by itself although the self reception feature is disabled
    #define ERRATA_ID_2583                                               // FlexCAN: OSCERCLK clock source must be enabled for CAN to function properly
    #define ERRATA_ID_2522                                               // FlexCAN: Rx FIFO Overflow bit is not set when one frame was read after a match when the FIFO is full
    #define ERRATA_ID_2545                                               // GPIO: PTB[0:11], PTB[16:23], PTC[0:19], and PTD[0:7] are not 5 V tolerant
    #define ERRATA_ID_3402                                               // GPIO: XTAL pin cannot be used as GPIO if the ERCLKEN bit is set
    #define ERRATA_ID_2793                                               // I2C: MCU does not wake from STOP mode on subsequent address matches if previous address is mismatched
    #define ERRATA_ID_3795                                               // I2S: fractional divider in SIM_CLKDIV2 is not reset when recovering from VLLSx low power modes
    #define ERRATA_ID_3714                                               // I2S: MCLK output is disabled in asynchronous mode
    #define ERRATA_ID_2613                                               // LLWU: MCU may not exit properly from VLLS3, VLLS2 or VLLS1 modes via a pin reset or other wakeup sources
    #define ERRATA_ID_2674                                               // LLWU: LLWU glitch filter for pin and reset is not supported
    #define ERRATA_ID_2680                                               // MC: after recovery from LLS low power mode triggered by assertion of the RESET pin, the MC_SRSL[WAKEUP] bit is not set as expected
    #define ERRATA_ID_2678                                               // MC: MC_SRS[PIN] is not always set after exiting a VLLS mode due to a RESET pin assertion
    #define ERRATA_ID_2676                                               // MC: when waking the system from VLLS modes via a RESET pin, the I/O are not immediately released to their reset state
    #define ERRATA_ID_3801                                               // MCG: in FEE and FEI Modes, the FLL output may stop when the DCO range is changed
    #define ERRATA_ID_2553                                               // MCG: MCGPLLCLK stalls for 2 PLL cycles if MCG_C5 is written to after the PLL is enabled
    #define ERRATA_ID_2556                                               // MCG: PLLCLKEN may not always enable the PLL
    #define ERRATA_ID_2796                                               // MCG: slow internal reference clock operating range does not meet specification
    #define ERRATA_ID_2555                                               // MCG: DCO within the FLL cannot reach the minimum specified frequency
    #define ERRATA_ID_2660                                               // MCG: PLL can be enabled in bypassed low power mode (BLPE) when the system is in normal stop mode
