uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_errata.h
    #define ERRATA_ID_3580                                               // MCG: total deviation of trimmed average DCO output frequency over voltage and temperature does not meet specification
    #define ERRATA_ID_2554                                               // MCG: when trimming the slow Internal Reference Clock (IRC) using the auto trim machine (ATM), the IRC is not automatically enabled
    #define ERRATA_ID_3794                                               // NVIC: NMI interrupt does not wakeup MCU from STOP and VLPS
    #define ERRATA_ID_2682                                               // PIT: does not generate a subsequent interrupt after clearing the interrupt flag
    #define ERRATA_ID_2548                                               // PMC: Power-on reset (POR) sensitive to noise on Vdd
    #define ERRATA_ID_4482                                               // PMC: STOP mode recovery unstable
    #define ERRATA_ID_2756                                               // PMC: static low power modes including STOP, VLPS, LLS, VLLSx are higher than specified
    #define ERRATA_ID_2706                                               // PMC: VLLS3 and VLLS2 recovery time is longer than specified
    #define ERRATA_ID_2542                                               // PMC: Very Low Power Run (VLPR) and Very Low Power Wait (VLPW) power modes are not supported
    #define ERRATA_ID_2541                                               // PORT: JTAG debug connectivity can not be achieved when using the RMII_RXER/MII_RXER alternate pin function on port pin PTA5 to connect to an Ethernet PHY
    #define ERRATA_ID_2578                                               // RTC: do not set RTC Update Mode via the RTC_CR[UM] bit
    #define ERRATA_ID_2573                                               // RTC: RTC interrupt is gated by the RTC_SR[TCE] bit - the interrupt will not assert on VBAT POR, VBAT power down, or when TCE = 0
    #define ERRATA_ID_2575                                               // RTC: Time Alarm Flag is cleared whenever the Seconds Counter increments and the Seconds Counter does not equal the Alarm Register
    #define ERRATA_ID_2655                                               // RTC: when RTC clock gating is disabled, accessing the VBAT register file causes the bus to hang
    #define ERRATA_ID_2577                                               // RTC: when RTC_CR[CLKO] = 1, the 32 kHz RTC clock to the rest of the device is not disabled
    #define ERRATA_ID_2576                                               // RTC: when the RTC is configured to allow supervisor access only, the write and read access registers can be modified in user mode
    #define ERRATA_ID_2574                                               // RTC: writing RTC_TAR[TAR] = 0 does not disable RTC alarm
    #define ERRATA_ID_3997                                               // Reset and Boot: MCU may fail to exit reset correctly
    #define ERRATA_ID_3981                                               // SDHC: ADMA fails when data length in the last descriptor is less or equal to 4 bytes
    #define ERRATA_ID_3982                                               // SDHC: ADMA transfer error when the block size is not a multiple of four
    #define ERRATA_ID_4624                                               // SDHC: AutoCMD12 and R1b polling problem
    #define ERRATA_ID_3977                                               // SDHC: does not support Infinite Block Transfer Mode
    #define ERRATA_ID_4627                                               // SDHC: erroneous CMD CRC error and CMD Index error may occur on sending new CMD during data transfer
    #define ERRATA_ID_3980                                               // SDHC: glitch is generated on card clock with software reset or clock divider change
    #define ERRATA_ID_3983                                               // SDHC: problem when ADMA2 last descriptor is LINK or NOP
    #define ERRATA_ID_3978                                               // SDHC: software cannot clear DMA interrupt status bit after read operation
    #define ERRATA_ID_3984                                               // SDHC: eSDHC misses SDIO interrupt when CINT is disabled
    #define ERRATA_ID_2572                                               // TPIU: Trace Port Interface Unit (TPIU) data setup and hold times do not conform to the ARM timing specification, ARM IHI0014O, section 8.4, "Timing specifications"
    #define ERRATA_ID_2591                                               // TSI: TSI_SCANC[SMOD] behaves as an inactive time instead of a scan period value
    #define ERRATA_ID_2638                                               // TSI: the counter registers are not immediately updated after the EOSF bit is set
    #define ERRATA_ID_2582                                               // UART: flow control timing issue can result in loss of characters
    #define ERRATA_ID_3892                                               // UART: ISO-7816 automatic initial character detect feature not working correctly
    #define ERRATA_ID_2584                                               // UART: possible conflicts between UART interrupt service routines and DMA requests
    #define ERRATA_ID_2544                                               // USB Voltage Regulator: universal serial bus (USB) regulator standby mode is not supported
    #define ERRATA_ID_2666                                               // VBAT: applying a fast ramp (>50V/ms) on the VBAT pin can cause both VBAT and VDD to latch up
    #define ERRATA_ID_2686                                               // WDOG: a watchdog reset while the system is in STOP or VLPS modes causes an incorrect wakeup sequence
#elif defined MASK_0N03G
#elif defined MASK_0N36M
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_8010                                               // LLWU: CMP flag in LLWU_Fx register cleared by multiple CMP out toggles when exiting LLSx or VLLSx modes
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_8011                                               // eDMA: possible corruption when writing an eDMA descriptor while the eDMA is active
#elif defined MASK_0N41J
#elif defined MASK_0N62J
#elif defined MASK_0N74K
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_8010                                               // LLWU: CMP flag in LLWU_Fx register cleared by multiple CMP out toggles when exiting LLSx or VLLSx modes
    #define ERRATA_ID_7950                                               // LLWU: when exiting from Low Leakage Stop (LLS) mode using the comparator, the comparator ISR is serviced before the LLWU ISR
    #define ERRATA_ID_7986                                               // LPUART: the LPUART_TX pin is tri-stated when the transmitter is disabled
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7998                                               // USB: USB host signal crossover voltage higher than specification at low temp or high voltage
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7857                                               // UART: WT timer in T=0 mode and CWT timer in T=1 mode can expire between 0.2 ETU to 0.8 ETU earlier than programmed
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
    #define ERRATA_ID_8011                                               // eDMA: possible corruption when writing an eDMA descriptor while the eDMA is active
#elif defined MASK_0N89E
#elif defined MASK_0N96B
    #define ERRATA_ID_7166                                               // SOC: SDHC, NFC, USBOTG, and cache modules are not clocked correctly in low-power modes (this errata is not listed but found to be vaid)
    #define ERRATA_ID_2550                                               // ADC: ADC abort conversion logic error
    #define ERRATA_ID_3863                                               // ADC: in 16-bit differential mode, ADC may result in a conversion error when positive input is near upper rail reference voltage
    #define ERRATA_ID_4588                                               // DMAMUX: when using PIT with "always enabled" request, DMA request does not deassert correctly
    #define ERRATA_ID_4154                                               // DryIce/RTC: analog clock tamper detect circuit is not operational
    #define ERRATA_ID_4170                                               // DryIce/RTC: analog temperature tamper detect circuit is not operational
    #define ERRATA_ID_3937                                               // EWM: interrupt not connected
    #define ERRATA_ID_5234                                               // GPIO: PORTF registers are not accessible unless SIM_SCGC5[PORTE] is set
    #define ERRATA_ID_2793                                               // I2C: MCU does not wake as expected from STOP or VLPS mode on subsequent address matches if previous address is mismatched
    #define ERRATA_ID_3925                                               // JTAG/OSC: JTAG enables digital input buffers
    #define ERRATA_ID_4553                                               // LCDC: Cursor Color Limited in 24bpp Mode
    #define ERRATA_ID_4569                                               // LCDC: Graphic Window Color Key Limited in 24bpp Mode
    #define ERRATA_ID_4570                                               // LCDC: Graphic Window May Shift Pixel Data
    #define ERRATA_ID_4571                                               // LCDC: LCDC can only use half of internal SRAM for frame buffer
    #define ERRATA_ID_3929                                               // MC: LLS and VLPS low power modes do not meet specified values
    #define ERRATA_ID_3898                                               // MCG: setting the MCG_C6[PLLS] bit will enable both OSC0 and OSC1.
    #define ERRATA_ID_4176                                               // NMI: NMI interrupt service routine (ISR) might not be called when MCU wakes up from VLLSx modes.
    #define ERRATA_ID_3794                                               // NVIC: NMI interrupt does not wakeup MCU from STOP and VLPS
    #define ERRATA_ID_4481                                               // PMC: STOP mode recovery unstable
    #define ERRATA_ID_4065                                               // PTD4 pin is not 5V tolerant
    #define ERRATA_ID_5138                                               // RTC: the RTC_WAKEUP pin does not operate as specified and the WPON bit in RTC_IER register does not work
    #define ERRATA_ID_5176                                               // Reset and Boot: Device may not exit the power on reset (POR) event correctly
    #define ERRATA_ID_5130                                               // SAI: under certain conditions, the CPU cannot reenter STOP mode via an asynchronous interrupt wakeup event
    #define ERRATA_ID_3981                                               // SDHC: ADMA fails when data length in the last descriptor is less or equal to 4 bytes
    #define ERRATA_ID_3982                                               // SDHC: ADMA transfer error when the block size is not a multiple of four
    #define ERRATA_ID_4624                                               // SDHC: AutoCMD12 and R1b polling problem
    #define ERRATA_ID_3977                                               // SDHC: does not support Infinite Block Transfer Mode
    #define ERRATA_ID_4627                                               // SDHC: erroneous CMD CRC error and CMD Index error may occur on sending new CMD during data transfer
    #define ERRATA_ID_3980                                               // SDHC: glitch is generated on card clock with software reset or clock divider change
    #define ERRATA_ID_6934                                               // SDHC: issues with card removal/insertion detection
    #define ERRATA_ID_3978                                               // SDHC: software cannot clear DMA interrupt status bit after read operation
    #define ERRATA_ID_3984                                               // SDHC: eSDHC misses SDIO interrupt when CINT is disabled
    #define ERRATA_ID_3941                                               // SIM/DDR: SIM_SOPT2[FBSL] does not determine allowable DDR controller accesses when security is enabled
    #define ERRATA_ID_3936                                               // SIM/ENET: Incorrect reset value for SIM_SCGC2[ENET]
    #define ERRATA_ID_4218                                               // SIM/FLEXBUS: SIM_SCGC7[FLEXBUS] bit should be cleared when the FlexBus is not being used
    #define ERRATA_ID_3935                                               // SIM: incorrect reset value for SIM_SCGC5[1]
    #define ERRATA_ID_3942                                               // SIM: incorrect signal output on CLKOUT pin when SIM_SOPT2[CLKOUTSEL] = 011
    #define ERRATA_ID_4189                                               // SOC: limitation of operating temperature range
    #define ERRATA_ID_3928                                               // TSI: delta voltage is 400 mV instead of 600 mV
    #define ERRATA_ID_3926                                               // TSI: The TSI will run several scan cycles during reference clock instead of scanning each electrode once
    #define ERRATA_ID_2638                                               // TSI: the counter registers are not immediately updated after the EOSF bit is set
    #define ERRATA_ID_4181                                               // SOC: limitation of operating temperature range
    #define ERRATA_ID_4935                                               // UART: CEA709.1 features not supported
    #define ERRATA_ID_2582                                               // UART: flow control timing issue can result in loss of characters
    #define ERRATA_ID_4945                                               // UART: ISO-7816 T=1 mode receive data format with a single stop bit is not supported
    #define ERRATA_ID_3892                                               // UART: ISO-7816 automatic initial character detect feature not working correctly
    #define ERRATA_ID_3964                                               // JTAGC: when debug is active a wakeup from STOP or VLPS with interrupt causes a hard fault interrupt
#elif defined MASK_1N30D_2N30D
#elif defined MASK_1N83J
    #define ERRATA_ID_6990                                               // CJTAG: possible incorrect TAP state machine advance during Check Packet
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_6749                                               // I2C: the I2C_C1[MST] bit is not automatically cleared when arbitration is lost
    #define ERRATA_ID_3981                                               // SDHC: ADMA fails when data length in the last descriptor is less or equal to 4 bytes
    #define ERRATA_ID_3982                                               // SDHC: ADMA transfer error when the block size is not a multiple of four
    #define ERRATA_ID_4627                                               // SDHC: erroneous CMD CRC error and CMD Index error may occur on sending new CMD during data transfer
    #define ERRATA_ID_3983                                               // SDHC: problem when ADMA2 last descriptor is LINK or NOP
    #define ERRATA_ID_7534                                               // SUBFAMID read back incorrect sub-family of the Kinetis device
    #define ERRATA_ID_7027                                               // UART: during ISO-7816 T=0 initial character detection invalid initial characters are stored in the RxFIFO
    #define ERRATA_ID_7028                                               // UART: during ISO-7816 initial character detection the parity, framing, and noise error flags can set
    #define ERRATA_ID_6472                                               // UART: ETU compensation needed for ISO-7816 wait time (WT) and block wait time (BWT)
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_7029                                               // UART: in ISO-7816 T=1 mode, CWT interrupts assert at both character and block boundaries
    #define ERRATA_ID_7090                                               // UART: in ISO-7816 mode, timer interrupts flags do not clear
    #define ERRATA_ID_7031                                               // UART: in single wire receive mode UART will attempt to transmit if data is written to UART_D
    #define ERRATA_ID_5704                                               // UART: TC bit in UARTx_S1 register is set before the last character is sent out in ISO7816 T=0 mode
    #define ERRATA_ID_7091                                               // UART: UART_S1[NF] and UART_S1[PE] can set erroneously while UART_S1[FE] is set
    #define ERRATA_ID_7092                                               // UART: UART_S1[TC] is not cleared by queuing a preamble or break character
    #define ERRATA_ID_6933                                               // eDMA: possible misbehavior of a preempted channel when using continuous link mode
    // The next errata is not included in the list in the document but has been found to be required with optimising compilers
    //
    #define ERRATA_ID_7914                                               // PIT: after enabling the Periodic Interrupt Timer (PIT) clock gate, an attempt to immediately enable the PIT module may not be successful
#elif defined MASK_1N89E
#elif defined MASK_1N96B
#elif defined MASK_2N03G
#elif defined MASK_2N22D
#elif defined MASK_3N03G
#elif defined MASK_3N96B
    #define ERRATA_ID_6378                                               // Cache: cache write buffer error enable (MCM_ISCR[CWBEE]) does not work
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_5243                                               // DDRMC: it is possible for data corruption to occur If the value programmed in RDLATADJ is larger than the CAS latency
    #define ERRATA_ID_5241                                               // DDRMC: putting the memory into a power down mode while DDR_CR11[AREFMODE] is set can prevent the DDRMC from providing refreshes to the memory while it is powered down
    #define ERRATA_ID_5263                                               // DDRMC: while the memory is in a power down state, setting DDR_CR11[AREF] in an attempt to force a refresh command will cause a refresh cycle to be missed
    #define ERRATA_ID_4588                                               // DMAMUX: when using PIT with "always enabled" request, DMA request does not deassert correctly
    #define ERRATA_ID_6358                                               // ENET: write to Transmit Descriptor Active Register (ENET_TDAR) is ignored
    #define ERRATA_ID_5861                                               // FTM: FTM2 and FTM3 do not correctly enter BDM mode when a debugger connection is active
    #define ERRATA_ID_4710                                               // FTM: FTMx_PWMLOAD register does not support 8-/16-bit accesses
    #define ERRATA_ID_6484                                               // FTM: the process of clearing the FTMx_SC[TOF] bit does not work as expected under a certain condition when the FTM counter reaches FTM_MOD value
    #define ERRATA_ID_6573                                               // JTAG: JTAG TDO function on the PTA2 disables the pull resistor
    #define ERRATA_ID_3964                                               // JTAGC: when debug is active a wakeup from STOP or VLPS with interrupt causes a hard fault interrupt
    #define ERRATA_ID_4553                                               // LCDC: cursor color limited in 24bpp Mode
    #define ERRATA_ID_4569                                               // LCDC: graphic window color key limited in 24bpp Mode
    #define ERRATA_ID_4570                                               // LCDC: graphic window may shift pixel data
    #define ERRATA_ID_4571                                               // LCDC: LCDC can only use half of internal SRAM for frame buffer
    #define ERRATA_ID_3898                                               // MCG: setting the MCG_C6[PLLS] bit will enable both OSC0 and OSC1
    #define ERRATA_ID_4590                                               // MCG: transitioning from VLPS to VLPR low power modes while in BLPI clock mode is not supported
    #define ERRATA_ID_4176                                               // NMI: NMI interrupt service routine (ISR) might not be called when MCU wakes up from VLLSx modes
    #define ERRATA_ID_3794                                               // NVIC: NMI interrupt does not wakeup MCU from STOP and VLPS
