uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_errata.h
    #define ERRATA_ID_5927                                               // Operating requirements: change to minimum VDD spec
    #define ERRATA_ID_5667                                               // PMC: when used as an input to ADC or CMP modules, the PMC bandgap 1-V voltage reference is not available in VLPx, LLS, or VLLSx modes
    #define ERRATA_ID_5130                                               // SAI: under certain conditions, the CPU cannot reenter STOP mode via an asynchronous interrupt wakeup event
    #define ERRATA_ID_3981                                               // SDHC: ADMA fails when data length in the last descriptor is less or equal to 4 bytes
    #define ERRATA_ID_3982                                               // SDHC: ADMA transfer error when the block size is not a multiple of four
    #define ERRATA_ID_4624                                               // SDHC: AutoCMD12 and R1b polling problem
    #define ERRATA_ID_3977                                               // SDHC: does not support Infinite Block Transfer Mode
    #define ERRATA_ID_4627                                               // SDHC: erroneous CMD CRC error and CMD Index error may occur on sending new CMD during data transfer
    #define ERRATA_ID_3980                                               // SDHC: glitch is generated on card clock with software reset or clock divider change
    #define ERRATA_ID_6934                                               // SDHC: issues with card removal/insertion detection
    #define ERRATA_ID_3983                                               // SDHC: problem when ADMA2 last descriptor is LINK or NOP
    #define ERRATA_ID_3978                                               // SDHC: software cannot clear DMA interrupt status bit after read operation
    #define ERRATA_ID_3984                                               // SDHC: eSDHC misses SDIO interrupt when CINT is disabled
    #define ERRATA_ID_3941                                               // SIM/DDR: SIM_SOPT2[FBSL] does not determine allowable DDR controller accesses when security is enabled
    #define ERRATA_ID_4218                                               // SIM/FLEXBUS: SIM_SCGC7[FLEXBUS] bit should be cleared when the FlexBus is not being used
    #define ERRATA_ID_5952                                               // SMC: wakeup via the LLWU from LLS/VLLS to RUN to VLPR incorrectly triggers an immediate wakeup from the next low power mode entry
    #define ERRATA_ID_7166                                               // SOC: SDHC, NFC, USBOTG, and cache modules are not clocked correctly in low-power modes
    #define ERRATA_ID_3926                                               // TSI: the TSI will run several scan cycles during reference clock instead of scanning each electrode once
    #define ERRATA_ID_2638                                               // TSI: the counter registers are not immediately updated after the EOSF bit is set
    #define ERRATA_ID_4546                                               // TSI: the counter values reported from TSI increase when in low power modes (LLS, VLLS1, VLLS2, VLLS3)
    #define ERRATA_ID_4181                                               // TSI: when the overrun flag is set, the TSI scanning sequence will exhibit undefined behavior
    #define ERRATA_ID_4935                                               // UART: CEA709.1 features not supported
    #define ERRATA_ID_7027                                               // UART: during ISO-7816 T=0 initial character detection invalid initial characters are stored in the RxFIFO
    #define ERRATA_ID_7028                                               // UART: during ISO-7816 initial character detection the parity, framing, and noise error flags can set
    #define ERRATA_ID_6472                                               // UART: ETU compensation needed for ISO-7816 wait time (WT) and block wait time (BWT)
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_4945                                               // UART: ISO-7816 T=1 mode receive data format with a single stop bit is not supported
    #define ERRATA_ID_3892                                               // UART: ISO-7816 automatic initial character detect feature not working correctly
    #define ERRATA_ID_7029                                               // UART: in ISO-7816 T=1 mode, CWT interrupts assert at both character and block boundaries
    #define ERRATA_ID_7090                                               // UART: in ISO-7816 mode, timer interrupts flags do not clear
    #define ERRATA_ID_7031                                               // UART: in single wire receive mode UART will attempt to transmit if data is written to UART_D
    #define ERRATA_ID_5704                                               // UART: TC bit in UARTx_S1 register is set before the last character is sent out in ISO7816 T=0 mode
    #define ERRATA_ID_7091                                               // UART: UART_S1[NF] and UART_S1[PE] can set erroneously while UART_S1[FE] is set
    #define ERRATA_ID_7092                                               // UART: UART_S1[TC] is not cleared by queuing a preamble or break character
    #define ERRATA_ID_5928                                               // USBOTG: USBx_USBTRC0[USBRESET] bit does not operate as expected in all cases
    #define ERRATA_ID_6933                                               // eDMA: possible misbehavior of a preempted channel when using continuous link mode
#elif defined MASK_1N86K                                                 // KL03
    #define ERRATA_ID_8060                                               // ROM: bytes sent from host over I2C and SPI interfaces may be lost
    #define ERRATA_ID_8058                                               // ROM: COP can't be re-enabled in application code due to being disabled by ROM boot code
    #define ERRATA_ID_8086                                               // ROM: fail to setup connection by UART interface if RX pin is low after POR
    #define ERRATA_ID_8059                                               // ROM: using UART at 57600 bits/s or greater with a core clock of 8 MHz may cause lost bytes
    #define ERRATA_ID_8068                                               // RTC: fail to enter low power mode if RTC time invalid flag (TIF) is not cleared after POR
    #define ERRATA_ID_8085                                               // TPM: writing the TPMx_MOD or TPMx_CnV registers more than once may fail when the timer is disabled
#elif defined MASK_0N65N                                                 // K65
    #define ERRATA_ID_8992                                               // AWIC: early NMI wakeup not detected upon entry to stop mode from VLPR mode
    #define ERRATA_ID_6939                                               // Core: interrupted loads to SP can cause erroneous behavior
    #define ERRATA_ID_6940                                               // Core: VDIV or VSQRT instructions might not complete correctly when very short ISRs are used
    #define ERRATA_ID_7993                                               // MCG: FLL frequency may be incorrect after changing the FLL reference clock
    #define ERRATA_ID_7735                                               // MCG: IREFST status bit may set before the IREFS multiplexor switches the FLL reference clock
    #define ERRATA_ID_3981                                               // SDHC: ADMA fails when data length in the last descriptor is less or equal to 4 bytes
    #define ERRATA_ID_3982                                               // SDHC: ADMA transfer error when the block size is not a multiple of four
    #define ERRATA_ID_4624                                               // SDHC: AutoCMD12 and R1b polling problem
    #define ERRATA_ID_3977                                               // SDHC: does not support Infinite Block Transfer Mode
    #define ERRATA_ID_4627                                               // SDHC: erroneous CMD CRC error and CMD Index error may occur on sending new CMD during data transfer
    #define ERRATA_ID_3984                                               // SDHC: eSDHC misses SDIO interrupt when CINT is disabled
    #define ERRATA_ID_3983                                               // SDHC: problem when ADMA2 last descriptor is LINK or NOP
    #define ERRATA_ID_3978                                               // SDHC: software cannot clear DMA interrupt status bit after read operation
    #define ERRATA_ID_4647                                               // UART: flow control timing issue can result in loss of characters if FIFO is not enabled
    #define ERRATA_ID_8807                                               // USB: in host mode, transmission errors may occur when communicating with a low speed (LS) device through a USB hub
    #define ERRATA_ID_7919                                               // USBOTG: in certain situations, software updates to the Start of Frame Threshold Register (USBx_SOFTHLD) may lead to an End of Frame error condition
    #define ERRATA_ID_9359                                               // USBReg: in some conditions when using both VREG_INn inputs, the USB voltage regulator current limit can fall below specification
#elif defined MASK_4N22D
#elif defined MASK_4N30D
#elif defined MASK_4N96B
#elif defined MASK_5N22D
#elif defined MASK_8N30D
#elif defined MASK_1N86B                                                 // Kinetis K - 50MHz masks
#elif defined MASK_1N36B                                                 // Kinetis K - 72MHz masks
#endif
